{"keras_version": "1.1.2", "config": [{"config": {"b_constraint": null, "activation": "linear", "nb_row": 5, "W_regularizer": null, "input_dtype": "float32", "trainable": true, "b_regularizer": null, "border_mode": "valid", "activity_regularizer": null, "batch_input_shape": [null, 66, 200, 3], "init": "glorot_uniform", "nb_col": 5, "nb_filter": 24, "bias": true, "W_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "activation": "linear", "nb_row": 5, "W_regularizer": null, "b_regularizer": null, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "nb_filter": 36, "bias": true, "W_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "activation": "linear", "nb_row": 5, "W_regularizer": null, "b_regularizer": null, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "nb_filter": 48, "bias": true, "W_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "activation": "linear", "nb_row": 3, "W_regularizer": null, "b_regularizer": null, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_filter": 64, "bias": true, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "name": "convolution2d_4"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "activation": "linear", "nb_row": 3, "W_regularizer": null, "b_regularizer": null, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "nb_filter": 64, "bias": true, "W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "name": "convolution2d_5"}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1024, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "bias": true, "W_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 128, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "bias": true, "W_constraint": null, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 64, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "bias": true, "W_constraint": null, "name": "dense_3"}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 16, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "bias": true, "W_constraint": null, "name": "dense_4"}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "input_dim": null, "activity_regularizer": null, "W_regularizer": null, "output_dim": 1, "b_regularizer": null, "trainable": true, "activation": "linear", "init": "glorot_uniform", "bias": true, "W_constraint": null, "name": "dense_5"}, "class_name": "Dense"}], "class_name": "Sequential"}